{
    "posts":
    [
        {
            "date": "01/20/2020",
            "author": "Lilian Gallon",
            "symbol": "fa-fw fas fa-cube",
            "title": "Bettercolors 6.1.0 preview & Minecraft Tutorial",
            "paragraphs": [
                "Bettercolors 6.1.0 will be released soon. I am still hesitating if I should include some features, or if I should add them in a future update since 6.1.0 already fixes a lot of issues. This way, I can focus on issues for the 6.1.0 version, and then on new features for 6.2.0. Once that the stable 6.1.0 version will be released, I will work on porting Bettercolors 6.1.0 for Minecraft 1.14.4 to Minecraft 1.15.2",
                "I added a new tab on my website called \"Tutorials\". I added the tutorial that I made for my CSE185E class at UCSC. It was my final project, and I got an A."
            ]
        },
        {
            "date": "12/02/2019",
            "author": "Lilian Gallon",
            "symbol": "fa-fw fas fa-home",
            "title": "New website, once again",
            "paragraphs": [
                " Clean, and automatically updated by using APIs. I was tired to update the website manually, so I decided to automate everything! I did not like the last website because it was difficult to see the information. Now we have more information, and we can read it more easily. I may create a dark theme based on the last website though! "
            ]
        },
        {
            "date": "10/01/2019",
            "author": "Lilian Gallon",
            "symbol": "fa-fw fab fa-itunes-note",
            "title": "playlistsByGenre becomes Music genre finder",
            "paragraphs": [
                "I am about to have a presentation in front of a whole lecture class. I had to find an interesting subject, and I came up with an idea. How to find the genre of a music without using artificial intelligence? My project is the answer of this question. I need to improve the project for it to be ready on the 10th of October (the day of my presentation).",
                "I have to make the contribution easier because the project depends on a dictionary binding genres to youtube channels. This way, people will find easier to add more and more data. Also, I thought about a website where people can find the music genre of some songs, and where they can put their contribution with an user-friendly interface.",
                "The slideshow used will be released shortly after, and will serve as an introduction to the project."
            ]
        },
        {
            "date": "09/25/2019",
            "author": "Lilian Gallon",
            "symbol": "fa-fw fas fa-university",
            "title": "I am back",
            "paragraphs": [
                "Now established at UCSC, I can resume my projects and all the stuff around. Some fixes have been pushed to particles.js which was updated to 1.5. In the next days, we can expect updates to be coming for the fractals explorer and the playlistByGenre project."
            ]
        },
        {
            "date": "08/29/2019",
            "author": "Lilian Gallon",
            "symbol": "fa-fw far fa-object-group",
            "title": "New domain, new website, new look",
            "paragraphs": [
                "After a week of work, I am proud to release this new site! Everything has been re-coded from scratch using bootstrap. It should be compatible with all modern browsers. You can get more details by going to the about page. More blog posts are coming about my projects, stay tuned!"
            ]
        }
    ]
}